ХМНПФ_Общее/Documents/уп_ВозвратПенсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВозвратПенсий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>хм_ВозвратСПлатежногоПоручения</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>хм_ПричинаВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.хм_ПричиныВозвратовПенсий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьЗадолженость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвращатьНДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвращатьРКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НекорректныеРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументВыплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ВыплатныеРеестры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыОперацийВозвратПенсий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДФЛНеУдержанВБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СчетДоговора</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипРезерва</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипПенсии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РКО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаКонцаПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Схема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаНачалаПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НБ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументВыплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уп_ВыплатныеРеестры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ВозвратПенсий/Forms/уф_ФормаДокументаОбщая/Ext/Form/Module.bsl
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ХМНПФ+ 26.02.2024 ЛыткинАМ // НПО Доработка возвратов // №3797
	НовыйЭлементФормы = ЭтаФорма.Элементы.Добавить("хм_ВозвратСПлатежногоПоручения",Тип("ПолеФормы"),ЭтаФорма.Элементы.хм_ГруппаВозвратСПлатежногоПоручения);
	НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементФормы.ПутьКДанным = "Объект.хм_ВозвратСПлатежногоПоручения";
	НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлементФормы.АвтоотметкаНезаполненного = Ложь;

	НовыйЭлементФормы = ЭтаФорма.Элементы.Добавить("хм_ПричинаВозврата",Тип("ПолеФормы"),ЭтаФорма.Элементы.хм_ГруппаВозвратСПлатежногоПоручения);
	НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементФормы.ПутьКДанным = "Объект.хм_ПричинаВозврата";
	НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлементФормы.АвтоотметкаНезаполненного = Ложь;

	// абонд, заполнение документа при создании из документа ПоступлениеНаРасчетныйСчет 
	Если Параметры.Свойство("СозданиеИзПоступления") Тогда
		ЗаполнитьДокументИзПоступления(Параметры.ДокументПоступление,
									   Параметры.ПричинаВозврата,
									   Параметры.Участник,
									   Параметры.ДокументВыплаты);	
	КонецЕсли; 

КонецПроцедуры

// ХМНПФ+ 26.02.2024 ЛыткинАМ // НПО Доработка возвратов // №3797
&НаСервере
Процедура ЗаполнитьДокументИзПоступления(ПоступлениеСсылка, ПричинаВозвратаСсылка, УчастникСсылка, ДокументОснованиеСсылка)
	
	Если ЗначениеЗаполнено(ПричинаВозвратаСсылка) Тогда
		РеквизитыПричиныВозврата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПричинаВозвратаСсылка,
		"СтавитьНеверныеРеквизиты,ВидОперацииВозврата,ПриостановкаВыплат,ДействиеССостояниемСчета,ПричинаПриостановки");
	КонецЕсли;
	
	РеквизитыПоступления 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоступлениеСсылка,
	"Дата,Организация");
	
	Объект.Дата 						  = РеквизитыПоступления.Дата;
	Объект.Организация  				  = РеквизитыПоступления.Организация;
	Если ЗначениеЗаполнено(ПричинаВозвратаСсылка) Тогда
		Объект.ВидОперации 				  	  = РеквизитыПричиныВозврата.ВидОперацииВозврата;
		Объект.НекорректныеРеквизиты 		  = РеквизитыПричиныВозврата.СтавитьНеверныеРеквизиты;
	КонецЕсли;
	Объект.Участник 					  = УчастникСсылка;
	Объект.ДокументВыплаты 			      = ДокументОснованиеСсылка;
	Объект.хм_ВозвратСПлатежногоПоручения = ПоступлениеСсылка;
	Объект.хм_ПричинаВозврата 			  = ПричинаВозвратаСсылка;
	Объект.Комментарий 				      = СтрШаблон("Создан автоматически по документу: %1",ПоступлениеСсылка);
	Объект.Ответственный 				  = Пользователи.ТекущийПользователь();
	
	Если ЗначениеЗаполнено(ДокументОснованиеСсылка) Тогда
		Документы.уп_ВозвратПенсий.РасчетПоДокументуВыплатыОбщий(Объект);
		РассчитатьДокументНаСервере();
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
&После("УстановитьВидимость")
Процедура ХМУстановитьВидимость()
	Если Элементы.Найти("хм_НДФЛНеУдержанВБюджет") = Неопределено Тогда
		НовыйЭлементФормы = ЭтаФорма.Элементы.Добавить("хм_НДФЛНеУдержанВБюджет",Тип("ПолеФормы"),ЭтаФорма.Элементы.ГруппаУчастникЛевая);
		НовыйЭлементФормы.Заголовок = "НДФЛ не удержан в бюджет";
		НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлементФормы.ПутьКДанным = "Объект.НДФЛНеУдержанВБюджет";
		НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	КонецЕсли;
	Элементы.хм_НДФЛНеУдержанВБюджет.Видимость = Элементы.ВозвращатьНДФЛ.Видимость; 
	// Вставить содержимое метода.
КонецПроцедуры
